--[[
    chord_config.lua
    『ChordDetection@DTMer Starter Kit.obj』でコードを判定するための設定ファイルです。
    必要に応じて編集してください。

    AviUtl の Script 同様、UTF-8 で保存しないと文字化けします。

    基本的なコードしか対応していない為、高度なコードを追加したい場合はコードマップと優先順位を編集してください。
    編集した『Chord_config.lua』ファイルを再配布する事を認めます。
    色々なコードに対応させたい場合は、ぜひ編集してみてください。
    ]]

return {
    note_table = {
        -- 音名から音番号への対応表
        ["C"] = 0,
        ["C#"] = 1,
        ["D♭"] = 1,
        ["D"] = 2,
        ["D#"] = 3,
        ["E♭"] = 3,
        ["E"] = 4,
        ["F"] = 5,
        ["F#"] = 6,
        ["G♭"] = 6,
        ["G"] = 7,
        ["G#"] = 8,
        ["A♭"] = 8,
        ["A"] = 9,
        ["A#"] = 10,
        ["B♭"] = 10,
        ["B"] = 11
    },

    map_table = {
        -- 音名の変換表
        ["C#"] = "D♭",
        ["D#"] = "E♭",
        ["F#"] = "G♭",
        ["G#"] = "A♭",
        ["A#"] = "B♭",
        ["D♭"] = "C#",
        ["E♭"] = "D#",
        ["G♭"] = "F#",
        ["A♭"] = "G#",
        ["B♭"] = "A#"
    },

    sharp_table = {
        -- シャープ系度数名対応表
        "Ⅰ", "Ⅰ#", "Ⅱ", "Ⅱ#", "Ⅲ", "Ⅳ", "Ⅳ#", "Ⅴ", "Ⅴ#", "Ⅵ", "Ⅵ#", "Ⅶ",
    },

    flat_table = {
        -- フラット系度数名対応表
        "Ⅰ", "Ⅱ♭", "Ⅱ", "Ⅲ♭", "Ⅲ", "Ⅳ", "Ⅴ♭", "Ⅴ", "Ⅵ♭", "Ⅵ", "Ⅶ♭", "Ⅶ",
    },

    chord_table = {
        --[[
        コードマップはコードの構成音とコード名の対応表です。
        コード構成音はルート音を0として、そこからの相対的な音程で表記します。
        例えば、Cメジャーキーの場合、対応する番号は
        0 = C
        1 = C#/D♭
        2 = D
        3 = D#/E♭
        4 = E
        5 = F
        6 = F#/G♭
        7 = G
        8 = G#/A♭
        9 = A
        10 = A#/B♭
        11 = B
        となります。
        例えば、Cメジャーコード(C,E,G)は(0,4,7)となります。
        ]]

        -- メジャーコード系
        ["0,4,7"] = "",       -- メジャー
        ["0,4,7,9"] = "6",    -- メジャー6th
        ["0,4,7,10"] = "7",   -- メジャー7th
        ["0,4,7,11"] = "M7",  -- メジャーメジャー7th
        ["0,4,7,2"] = "add9", -- メジャーadd9

        -- マイナーコード系
        ["0,3,7"] = "m",     -- マイナー
        ["0,3,7,9"] = "m6",  -- マイナー6th
        ["0,3,7,10"] = "m7", -- マイナー7th

        -- その他のコード
        ["0,4,8"] = "aug",  -- オーグメント
        ["0,3,6"] = "dim",  -- ディミニッシュ
        ["0,5,7"] = "sus4", -- サスペンデッド4th
        ["0,7"] = "5"       -- パワーコード
    },

    -- コード判定の優先順位
    priority_table = {
        --[[
        数字が小さいほど優先順位が高くなります。
        判定時に複数のコードが該当する場合、優先度の高いコードが選択されます。
        例えば、Cメジャーコード(0,4,7)はC6(0,4,7,9)やCadd9(0,4,7,2)の部分集合でもあるため、
        優先順位を設定することで、Cメジャーコードが正しく選択されるようにします。
        コード名はコードマップ内で設定されてるものと一致させてください。一致していない場合、正しく動作しません。
        例：コードマップで『M7』と表記してあるが、コードプライオリティで『Maj7』や『△7』と表記してある等。
        ]]
        ["add9"] = 1,
        ["sus4"] = 2,
        [""] = 3,
        ["m"] = 3,
        ["6"] = 4,
        ["m6"] = 4,
        ["7"] = 5,
        ["M7"] = 6,
        ["m7"] = 6,
        ["aug"] = 7,
        ["dim"] = 7,
        ["5"] = 8
    }
}
